<%@ page language="java" import="java.util.*" pageEncoding="utf-8"%>
<%@ page isELIgnored="false" %>
<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=utf8">
<title>有据,专注量化投资</title>

<link rel="stylesheet" href="${pageContext.request.contextPath}/css/common/reset.css"/>
<link rel="stylesheet" href="${pageContext.request.contextPath}/css/common/common.css"/>
<link rel="icon" href="${pageContext.request.contextPath}/images/favicon.ico" type="image/x-icon">
<script type="text/javascript" src="${pageContext.request.contextPath}/script/plugins/jquery-1.12.4.min.js"></script>
<script type="text/javascript" src="${pageContext.request.contextPath}/script/plugins/layer/layer.js"></script>
<script type="text/javascript" src="${pageContext.request.contextPath}/script/plugins/laydate/laydate.js"></script>
<script type="text/javascript" src="${pageContext.request.contextPath}/script/plugins/jquery.cookie.js"></script>
<script type="text/javascript" src="${pageContext.request.contextPath}/script/plugins/md5.js"></script>
<script type="text/javascript" src="${pageContext.request.contextPath}/script/plugins/template.js"></script>
<script type="text/javascript" src="${pageContext.request.contextPath}/script/plugins/StringUtils.js"></script>
<script type="text/javascript" src="${pageContext.request.contextPath}/script/plugins/AjaxUtils.js"></script>
<script type="text/javascript" src="${pageContext.request.contextPath}/script/plugins/pager.js"></script>
<script type="text/javascript" src="${pageContext.request.contextPath}/script/common/common.js"></script>
<style type="text/css">
	div{
	width:1200px;
	margin:0 auto;
	padding:50px 0;
	font-size:14px;
	line-height:24px;
	}
	.actiltitle{
		font-size:18px;
		text-align:center;
		font-weight:700;
	}
	.top{
		font-size:14px;
		color:#333333;
		margin-top:43px;
		font-weight:600
	}
	.title{
		color:#333333;
		font-weight:600;
		margin-top:35px;
	}
</style>

<!--[if lt IE 9]>
<link rel="stylesheet" href="${pageContext.request.contextPath}/css/frontend/ie8.css"/>
  <![endif]-->
</head>
<body>
	
	<div>
	<p class='actiltitle'>《有据量化用户协议》</p>
	<p class='top'>有据量化金融科技服务（以下简称“本服务”）是由成都有据量化科技有限公司（以下简称“本公司”）向有据量化用户提供的投资研究、投资管理、数据定制、交易系统集成等服务，详见ujuqt.com网站（以下简称“本网站”）上相关产品及服务介绍。本协议由您和本公司签订。
	</p>
<p class='title'>1、总则</p>
<p>
1.1 您确认：您在使用本服务之前，请您充分阅读、理解并接受本协议的全部内容，一旦您选择“同意”并完成注册开启流程或使用本服务，即表示您同意遵循本协议及与之相关的所有约定。 <br/>
1.2 您同意：本公司有权随时对本协议及相应的服务规则内容进行单方面的变更，并以消息推送、网页公告等方式予以公布，无需另行单独通知您；若您在本协议内容公告变更后继续使用本服务的，表示您已充分阅读、理解并接受修改后的协议内容，也将遵循修改后的协议内容使用本服务；若您不同意修改后的协议内容，您应立即停止使用本服务。<br/>
</p>
<p class='title'>2、账户</p>
2.1 注册<br/> 
2.1.1. 注册者资格<br/> 
您确认，在您完成注册程序或以其他本公司允许的方式实际使用本服务时，您应当是具备完全民事权利能力和完全民事行为能力的自然人、法人或其他组织。若您不具备前述主体资格，则您及您的监护人应承担因此而导致的一切后果，且本公司有权注销（永久冻结）您的账户，并向您及您的监护人索偿。 <br/>
注册者应在注册前确认已获得网站内容所有权人的合法授权，只有在获得有据量化或其他相关权利人的授权之后才能使用这些内容，而不能擅自复制、再造这些内容、或创造与内容有关的派生产品。 <br/>
2.1.2. 注册和账户<br/> 
在您按照注册页面提示填写信息、阅读并同意本协议且完成全部注册程序后，或在您按照激活页面提示填写信息、阅读并同意本协议且完成全部激活程序后，或您以其他本公司允许的方式实际使用本网站服务时，您即受本协议约束。您可以使用您提供或确认的用户名或者本公司允许的其它方式作为登录手段进入本网站。 <br/>
2.1.3. 信息<br/> 
2.1.3.1. 在完成注册或激活流程时，您应当按照法律法规要求，按相应页面的提示准确提供并及时更新您的资料，以使之真实、及时，完整和准确。如有合理理由怀疑您提供的资料错误、不实、过时或不完整的，本公司有权向您发出询问及或要求改正的通知，并有权直接做出删除相应资料的处理，直至中止、终止对您提供部分或全部服务。本公司对此不承担任何责任，您将承担因此产生的任何直接或间接损失及不利后果。 <br/>
2.1.3.2. 您应当准确填写并及时更新您提供的电子邮件地址、联系电话等联系方式，以便本公司或其他会员与您进行联系，因通过这些联系方式无法与您取得联系，导致您在使用有据量化服务过程中产生任何损失或增加费用的，应由您完全独自承担。您了解并同意，您有义务保持您提供的联系方式的有效性和及时畅通性，如有变更需要更新的，您应按本公司的要求进行操作。 <br/>
2.2 账户安全<br/> 
2.2.1. 您须自行负责对您的登录名和密码保密，且须对您在该登录名和密码下发生的所有活动（包括但不限于信息披露、发布信息、网上点击同意或提交各类规则协议、网上续签协议或购买服务等）承担责任。您同意：(a)如发现任何人未经授权使用您的登录名和密码，或发生违反保密规定的任何其他情况，您会立即通知本公司，并授权本公司将该信息同步给本网站；及(b)确保您在每个上网时段结束时，以正确步骤离开网站。本公司不能也不会对因您未能遵守本款规定而发生的任何损失或因此需要承担的任何责任负责。您理解本公司对您的请求采取行动需要合理时间，本公司对在采取行动前已经产生的后果（包括但不限于您的任何损失）不承担任何责任，且对本公司已经采取合理行动后但仍未能避免的任何损失负责。除非有法律规定或司法裁定，且征得本公司的同意，否则，您的登录名和密码不得以任何方 式转让、赠与或继承（与账户相关的财产权益除外）。<br/> 
2.3 账户注销<br/> 
本公司保留在您违反国家、地方法律法规规定或违反本服务条款的情况下中止或终止为您提供服务的权利。

<p class='title'>3、服务使用守则</p>
为有效保障您使用本服务的合法权益，您理解并同意接受以下规则： 
3.1 您在使用本服务过程中，本协议内容、页面上出现的关于交易操作的提示或本公司发送到您手机的信息（短信或电话等）内容是您使用本服务的相关规则，您使用本服务即表示您同意接受本服务的相关规则。您了解并同意本公司有权单方修改服务的相关规则，而无须征得您的同意，服务规则应以您使用服务时的页面提示（或发送到该手机的短信或电话等）为准，您同意并遵照服务规则是您使用本服务的前提。 
3.2 本公司可能会以电子邮件（或发送到您手机的短信或电话等）方式通知您服务进展情况以及提示您进行下一步的操作，但本公司不保证您能够收到或者及时收到该邮件（或发送到该手机的短信或电话等），且对此承担任何后果。因此，在服务过程中您应当及时登录到本网站查看和进行交易操作。因您没有及时查看和对服务状态进行修改或确认或未能提交相关申请而导致的任何纠纷或损失，本公司不负任何责任。 
3.3 您授权本公司可以通过向第三方审核您的身份和资格，并取得您使用本服务的相关资料。 
3.4 在您使用本服务时，本公司有权依照相应的服务收费介绍、订单及/或相关协议向您收取服务费用。本公司拥有制订及调整服务费之权利，具体服务费用以您使用本服务时页面上所列之收费方式公告或您与本公司达成的其他书面协议为准。

<p class='title'>4、您的权利和义务</p>
4.1 您有权利享受有据量化提供的互联网技术和信息服务，并有权利在接受本公司提供的服务时获得本公司的技术支持、咨询等服务，服务内容详见ujuqt.com网站相关产品介绍。 <br/>
4.2 您保证不会利用技术或其他手段破坏或扰乱本网站及有据量化其他客户的网站。 <br/>
4.3 您应尊重本公司及其他第三方的知识产权和其他合法权利，并保证在发生侵犯上述权益的违法事件时尽力保护本公司及其股东、雇员、合作伙伴等免于因该等事件受到影响或损失；本公司保留您侵犯本公司合法权益时终止向您提供服务、不退还任何款项并追究所有法律责任的权利。 <br/>
4.4 对由于您向ujuqt.com提供的联络方式有误或者联系渠道不畅通以及您用于接受ujuqt.com邮件的电子邮箱安全性、稳定性不佳而导致的一切后果，您应自行承担责任，包括但不限于因您未能及时收到ujuqt.com的相关通知而导致的后果和损失。 <br/>
4.5 您保证您使用本服务时将遵从国家、地方法律法规、行业惯例和社会公共道德，不会利用本公司提供的服务进行存储、发布、传播如下信息和内容：违反国家法律法规政策的任何内容（信息）；违反国家规定的政治宣传和/或新闻信息；涉及国家秘密和/或安全的信息；封建迷信和/或淫秽、色情、下流的信息或教唆犯罪的信息；博彩有奖、赌博游戏；违反国家民族和宗教政策的信息；防碍互联网运行安全的信息；侵害他人合法权益的信息和/或其他有损于社会秩序、社会治安、公共道德的信息或内容。您同时承诺不得为他人发布上述不符合国家规定和/或本服务条款约定的信息内容提供任何便利，包括但不限于设置URL、BANNER链接等。您承认本公司有权在您违反上述约定时有权终止向您提供服务并不予退还任何款项，因您上述行为给本公司造成损失的，您应予赔偿。 <br/>
4.6 在使用本软件产品时所涉及到的所有信息和数据：包括但不限于客户资料、信息、数据、文字、软件、声音、相片、录像、图表等均为本公司的商业信息，所有这些信息的内容受版权、商标权、其它知识产权和所有权法律的保护。所以，用户只能在您(个人或单一机构团体)范围内使用。更不得传播至您(个人或单一机构团体)以外的范围，或者用于商业用途。 <br/>
4.7 您可以在网站上发表内容，但您必须确认您在网站上发表的内容系其本人享有著作权的作品或已获得著作权人合法许可发表。

<p class='title'>5、有据量化的权利和义务</p>
5.1 有据量化不对用户是否取得信息所有权人合法授权进行实质审查，用户获取或发表信息的行为均系用户个人行为。 <br/>
5.2 有据量化应根据您选择的服务以及交纳款项的情况向您提供合格的网络技术和信息服务。 <br/>
5.3 有据量化承诺对您资料采取对外保密措施，不主动向第三方披露您资料，不授权第三方使用您资料，除非： <br/>
5.3.1. 依据本协议条款或者您与有据量化之间其他服务协议、合同、在线条款等规定可以提供； <br/>
5.3.2. 依据法律法规的规定应当提供； <br/>
5.3.3. 行政、司法等职权部门要求有据量化提供； <br/>
5.3.4. 您同意有据量化向第三方提供； <br/>
5.3.5. 有据量化解决举报事件、提起诉讼而提交的； <br/>
5.3.6. 有据量化为防止严重违法行为或涉嫌犯罪行为发生而采取必要合理行动所必须提交的； <br/>
5.3.7. 有据量化为向您提供产品、服务、信息而向第三方提供的，包括有据量化通过第三方的技术及服务向您提供产品、服务、信息的情况。

<p class='title'>6、隐私及其他个人信息的保护</p>
一旦您同意本协议或使用本服务，您即同意本公司按照以下条款来使用和披露您的个人信息。 <br/>
6.1 登录名和密码<br/> 
在您注册帐户时，我们会要求您设置登录名和密码来识别您的身份。您仅可通过您设置的密码来使用该账户，如果您因各种主动或被动的方式泄漏了密码，您可能会丢失您的个人识别信息，并可能导致对您不利的法律后果。该账户和密码因任何原因受到潜在或现实危险时，您应该立即和本公司取得联系，在本公司采取行动前，本公司对此不负任何责任。 <br/>
6.2 用户信息<br/> 
您完成账户注册或激活流程该账户时，应向本公司提供您的公司名称、联系人、电话或邮箱。 <br/>
6.3 银行账户信息<br/> 
若本公司所提供的服务需要您提供您的银行账户信息，在您提供相应信息后，本公司将严格履行相关保密约定。 
6.4 登录记录<br/> 
为了保障您使用本服务的安全以及不断改进服务质量，本公司将记录并保存您登录和使用本服务的相关信息，但本公司承诺不将此类信息提供给任何第三方（除双方另有约定或法律法规另有规定及本公司关联公司外）。 <br/>
6.5 广告<br/> 
本公司会对ujuqt.com用户的身份数据进行综合统计，并出于销售和奖励的需要使用或披露。 <br/>
6.6 服务信息的收集和存储<br/> 
出于a.提供服务必须收集，否则服务无法提供b.改善我们的产品和服务，以期更好地满足您的需求，为您提供定制化服务，否则您的产品或者服务体验相对会弱化的目的，本公司有可能自动从您的智能终端（包括手机、电脑和电视等）和浏览器上收集和存储您的软件信息、硬件信息、您主动上传至有据量化服务器的信息及您使用偏好信息，上述信息包括但不限于您手机IMEI号，登录名，操作系统信息，您的IP地址，Cookie信息，GPS等位置服务使用情况，您所访问的页面等信息。 
6.7 外部链接<br/> 
本网站含有到其他网站的链接，但本公司对其他网站的隐私保护措施不负任何责任。本公司可能在任何需要的时候增加商业伙伴或共用品牌的网站。 <br/>
6.8 安全<br/> 
本公司仅按现有技术提供相应的安全措施来使本公司掌握的信息不丢失，不被滥用和变造。这些安全措施包括向其他服务器备份数据和对用户密码加密。尽管有这些安全措施，但本公司不保证这些信息的绝对安全。 <br/>
6.9 使用<br/> 
6.9.1. 本公司会将依法收集到的您的个人信息用于审计、数据分析、研究和关联公司之间分享等内部目的，这样您可以更好地享受到本公司为您提供的全面服务，本公司也可以改进本公司的产品与服务。 <br/>
6.9.2. 视具体情况，本公司会向与本公司合作提供产品和服务或者帮助本公司向客户进行营销的合作伙伴提供某些个人信息。本公司只会为提供或改进本公司的产品、服务和广告宣传之目的而与第三方共享个人信息；而不会为第三方的营销目的与第三方共享个人信息，更不会销售个人信息。本公司有义务要求上述合作伙伴严格遵守保密约定。<br/>

<p class='title'>7、产品风险提示</p>
7.1 用户应充分认识到投资的风险。公司所提供的所有服务和信息，仅供用户参考使用，不构成用户进行投资操作的直接依据，用户据此操作，风险自担，公司不承担任何经济和法律责任。 <br/>
7.2 公司通过产品为用户提供财经金融资讯和行情数据等信息，公司对用户的投资决策可能带来的风险或损失不承担任何违约、赔偿或其他民事责任。 <br/>
7.3 使用本公司产品由用户自己承担风险，在任何情况下成都有据量化科技有限公司不就因使用或不能使用本公司产品所发生的特殊的、意外的、直接的或间接的损失承担赔偿责任。

<p class='title'>8、系统中断或故障</p>
系统可能因下列状况无法正常运作，使您无法使用各项联网服务时，本公司不承担损害赔偿责任，该状况包括但不限于： <br/>
8.1 本公司在系统停机维护期间。 <br/>
8.2 电信设备出现故障不能进行数据传输的。 <br/>
8.3 因台风、地震、海啸、洪水、停电、战争、恐怖袭击等不可抗力之因素，造成本公司系统障碍不能执行业务的。 <br/>
8.4 由于黑客攻击、电信部门技术调整或故障、网站升级、银行方面的问题等原因而造成的服务中断或者延迟。

<p class='title'>9、责任范围及责任限制</p>
9.1 本公司仅对本协议中列明的责任承担范围负责。 <br/>
9.2 本服务之合作单位、顾问及代理等，所提供之服务品质及内容由其自行负责。 <br/>
9.3 在法律允许的情况下，本公司对于与本协议有关或由本协议引起的任何间接的、惩罚性的、特殊的、派生的损失（包括业务损失、收益损失、利润损失、使用数据或其他经济利益的损失），不论是如何产生的，也不论是由对本协议的违约（包括违反保证）还是由侵权造成的，均不负有任何责任，即使事先已被告知此等损失的可能性。另外即使本协议规定的排他性救济没有达到其基本目的，也应排除本公司对上述损失的责任。 <br/>
9.4 除本协议另有规定外，在任何情况下，您同意本公司对本协议所承担的赔偿责任总额不超过向您收取的当次服务费用总额。

<p class='title'>10、完整协议</p>
本协议由本协议条款与本网站公示的各项规则组成，相关名词可互相引用参照，如有不同理解，以本协议条款为准。 <br/>
您对本协议理解和认同，您即对本协议所有组成部分的内容理解并认同，一旦您使用本服务，您和本公司即受本协议所有组成部分的约束。 <br/>
本协议部分内容被有管辖权的法院认定为违法的，因此影响其他内容的效力。

<p class='title'>11、商标、知识产权的保护</p>
11.1 除第三方产品或服务外，本网站上所有内容，包括但不限于著作、图片、档案、资讯、资料、架构、页面设计，均由本公司或本公司关联企业依法拥有其知识产权，包括但不限于商标权、专利权、著作权、商业秘密等。任何被授权的浏览、复制、打印和传播属于ujuqt.com网站内信息内容都不得用于商业目的且所有信息内容及其任何部分的使用都必须包括此版权声明。 <br/>
11.2 非经本公司或本公司关联企业书面同意，任何人不得擅自使用、修改、复制、公开传播、改变、散布、发行或公开发表本网站上程序或内容。 <br/>
11.3 尊重知识产权是您应尽的义务，如有违反，您应承担损害赔偿责任。

<p class='title'>12、法律适用与管辖</p>
本协议之效力、解释、变更、执行与争议解决均适用中华人民共和国法律。因本协议产生之争议，各方均有权将争议提交本公司所在地法院予以诉讼。
	</div>
</body>
</html>